import styled from 'styled-components';

export const MockupSofa = () => (
    <SVG xmlns="http://www.w3.org/2000/svg"  width="457.777" height="368.868" viewBox="0 0 457.777 368.868">
  <defs>
    <linearGradient id="linear-gradient" x1="0.5" y1="1" x2="0.5" gradientUnits="objectBoundingBox">
      <stop offset="0" stop-color="gray" stop-opacity="0.251"/>
      <stop offset="0.54" stop-color="gray" stop-opacity="0.122"/>
      <stop offset="1" stop-color="gray" stop-opacity="0.102"/>
    </linearGradient>
    <linearGradient id="linear-gradient-2" x1="7.194" y1="-9.858" x2="7.194" y2="-10.955" />
    <linearGradient id="linear-gradient-3" x1="47.005" y1="-76.977" x2="47.005" y2="-77.977" />
    <linearGradient id="linear-gradient-4" x1="45.78" y1="-75.851" x2="45.78" y2="-76.851" />
    <linearGradient id="linear-gradient-5" x1="45.657" y1="-78.237" x2="45.657" y2="-79.237" />
    <linearGradient id="linear-gradient-6" x1="44.401" y1="-77.207" x2="44.401" y2="-78.207" />
    <linearGradient id="linear-gradient-7" y1="1.001" y2="0" />
    <linearGradient id="linear-gradient-8" y1="1" y2="0" />
    <linearGradient id="linear-gradient-9" x1="0.501" y1="1" x2="0.501" gradientUnits="objectBoundingBox">
      <stop offset="0" stop-color="#fff"/>
      <stop offset="1"/>
    </linearGradient>
    <linearGradient id="linear-gradient-10" y1="1" y2="0" />
    <linearGradient id="linear-gradient-11" x1="5.982" y1="-11.162" x2="5.982" y2="-12.162" />
    <linearGradient id="linear-gradient-12" x1="3.661" y1="-6.311" x2="3.661" y2="-7.416" />
  </defs>
  <g id="undraw_chilling_8tii" transform="translate(0 0.007)">
    <g id="Groupe_25" data-name="Groupe 25" transform="translate(0 42.735)" opacity="0.5">
      <path id="Tracé_65" data-name="Tracé 65" d="M548.633,198.874H485.941V174.886a25.126,25.126,0,0,0-25.126-25.126H173.77a22.794,22.794,0,0,0-22.794,22.794v26.334h-9.439A26.527,26.527,0,0,0,115,225.383V344.311a26.523,26.523,0,0,0,24.541,26.428v26.9h26.8v-26.82h33.743v27.047h26.8V370.819H468.036v27.047h26.8V370.819h22.332v26.8h26.825v-26.8h4.828a23.956,23.956,0,0,0,23.96-23.96V223.023a24.145,24.145,0,0,0-24.149-24.149ZM481.222,303.828v20.1h-99.9a12.974,12.974,0,0,0,1.647-6.338V303.828Z" transform="translate(-115 -149.76)" fill="url(#linear-gradient)"/>
    </g>
    <rect id="Rectangle_41" data-name="Rectangle 41" width="25.801" height="32.252" transform="translate(32.148 253.742)" fill="#6c63ff"/>
    <rect id="Rectangle_42" data-name="Rectangle 42" width="25.801" height="32.252" transform="translate(348.463 253.983)" fill="#6c63ff"/>
    <rect id="Rectangle_43" data-name="Rectangle 43" width="25.801" height="32.252" transform="translate(395.765 253.742)" fill="#6c63ff"/>
    <rect id="Rectangle_44" data-name="Rectangle 44" width="25.801" height="32.252" transform="translate(90.442 253.983)" fill="#6c63ff"/>
    <rect id="Rectangle_45" data-name="Rectangle 45" width="25.801" height="32.252" transform="translate(32.148 253.742)" opacity="0.3"/>
    <rect id="Rectangle_46" data-name="Rectangle 46" width="25.801" height="32.252" transform="translate(348.463 253.983)" opacity="0.3"/>
    <rect id="Rectangle_47" data-name="Rectangle 47" width="25.801" height="32.252" transform="translate(395.765 253.742)" opacity="0.3"/>
    <rect id="Rectangle_48" data-name="Rectangle 48" width="25.801" height="32.252" transform="translate(90.442 253.983)" opacity="0.3"/>
    <path id="Tracé_66" data-name="Tracé 66" d="M765.2,200.52h64.91a23.247,23.247,0,0,1,23.248,23.248V343.021a23.064,23.064,0,0,1-23.064,23.064H765.2Z" transform="translate(-404.075 -105.891)" fill="#6c63ff"/>
    <path id="Tracé_67" data-name="Tracé 67" d="M765.2,200.52h64.91a23.247,23.247,0,0,1,23.248,23.248V343.021a23.064,23.064,0,0,1-23.064,23.064H765.2Z" transform="translate(-404.075 -105.891)" opacity="0.3"/>
    <path id="Tracé_68" data-name="Tracé 68" d="M113.35,100.29H237.615V248.652H91.4V122.235a21.949,21.949,0,0,1,21.945-21.945Z" transform="translate(-48.265 -52.963)" fill="#6c63ff"/>
    <path id="Tracé_69" data-name="Tracé 69" d="M114.058,100.29H237.615V248.652H91.4V122.943a22.653,22.653,0,0,1,22.658-22.653Z" transform="translate(-48.265 -52.963)" opacity="0.3"/>
    <path id="Tracé_70" data-name="Tracé 70" d="M180.41,100.29H300.9V248.652H154.68V126.015a25.725,25.725,0,0,1,25.725-25.725Z" transform="translate(-81.681 -52.963)" fill="#6c63ff"/>
    <path id="Tracé_71" data-name="Tracé 71" d="M463,100.29H585.963a24.2,24.2,0,0,1,24.2,24.2V248.652H463Z" transform="translate(-244.494 -52.963)" fill="#6c63ff"/>
    <path id="Tracé_72" data-name="Tracé 72" d="M851.77,200.52h24.069a23.248,23.248,0,0,1,23.233,23.248V343.021a23.064,23.064,0,0,1-23.064,23.064H851.77Z" transform="translate(-449.79 -105.891)" fill="#6c63ff"/>
    <rect id="Rectangle_49" data-name="Rectangle 49" width="296.725" height="45.155" transform="translate(105.251 215.038)" fill="#6c63ff"/>
    <rect id="Rectangle_50" data-name="Rectangle 50" width="87.62" height="92.23" rx="43.81" transform="translate(115.161 117.434) rotate(-16.25)" fill="url(#linear-gradient-2)"/>
    <rect id="Rectangle_51" data-name="Rectangle 51" width="81.706" height="86.006" rx="40.853" transform="translate(117.308 120.689) rotate(-16.25)" fill="#f55f44"/>
    <rect id="Rectangle_52" data-name="Rectangle 52" width="81.706" height="86.006" rx="40.853" transform="translate(117.308 120.689) rotate(-16.25)" opacity="0.1"/>
    <rect id="Rectangle_53" data-name="Rectangle 53" width="81.706" height="86.006" rx="40.853" transform="translate(118.868 119.593) rotate(-16.25)" fill="#f55f44"/>
    <circle id="Ellipse_28" data-name="Ellipse 28" cx="6.451" cy="6.451" r="6.451" transform="matrix(0.818, -0.575, 0.575, 0.818, 154.04, 126.579)" fill="url(#linear-gradient-3)"/>
    <circle id="Ellipse_29" data-name="Ellipse 29" cx="6.451" cy="6.451" r="6.451" transform="matrix(0.818, -0.575, 0.575, 0.818, 184.905, 144.299)" fill="url(#linear-gradient-4)"/>
    <circle id="Ellipse_30" data-name="Ellipse 30" cx="6.451" cy="6.451" r="6.451" transform="matrix(0.818, -0.575, 0.575, 0.818, 137.03, 162.193)" fill="url(#linear-gradient-5)"/>
    <circle id="Ellipse_31" data-name="Ellipse 31" cx="6.451" cy="6.451" r="6.451" transform="matrix(0.818, -0.575, 0.575, 0.818, 166.134, 181.154)" fill="url(#linear-gradient-6)"/>
    <circle id="Ellipse_32" data-name="Ellipse 32" cx="4.299" cy="4.299" r="4.299" transform="matrix(0.818, -0.575, 0.575, 0.818, 157.038, 127.101)" fill="#f99f8f"/>
    <circle id="Ellipse_33" data-name="Ellipse 33" cx="4.299" cy="4.299" r="4.299" transform="matrix(0.818, -0.575, 0.575, 0.818, 187.903, 144.821)" fill="#f99f8f"/>
    <circle id="Ellipse_34" data-name="Ellipse 34" cx="4.299" cy="4.299" r="4.299" transform="matrix(0.818, -0.575, 0.575, 0.818, 140.029, 162.715)" fill="#f99f8f"/>
    <circle id="Ellipse_35" data-name="Ellipse 35" cx="4.299" cy="4.299" r="4.299" transform="matrix(0.818, -0.575, 0.575, 0.818, 169.132, 181.676)" fill="#f99f8f"/>
    <path id="Tracé_73" data-name="Tracé 73" d="M43.546,200.52H138.4V366.084H43.546A25.546,25.546,0,0,1,18,340.543V226.066A25.546,25.546,0,0,1,43.546,200.52Z" transform="translate(-9.505 -105.891)" fill="#6c63ff"/>
    <path id="Tracé_74" data-name="Tracé 74" d="M43.725,200.52h70.88a23.8,23.8,0,0,1,23.8,23.823V342.28a23.8,23.8,0,0,1-23.8,23.8H43.725A25.725,25.725,0,0,1,18,340.359V226.231A25.725,25.725,0,0,1,43.725,200.52Z" transform="translate(-9.505 -105.891)" opacity="0.3"/>
    <path id="Tracé_75" data-name="Tracé 75" d="M173.41,200.52h41.431a8.023,8.023,0,0,1,8.023,8.023V358.062a8.023,8.023,0,0,1-8.023,8.023H173.41Z" transform="translate(-91.572 -105.891)" opacity="0.1"/>
    <path id="Tracé_76" data-name="Tracé 76" d="M168.35,200.52h41.431a8.023,8.023,0,0,1,8.023,8.023V358.062a8.023,8.023,0,0,1-8.023,8.023H168.35Z" transform="translate(-88.9 -105.891)" fill="#6c63ff"/>
    <rect id="Rectangle_54" data-name="Rectangle 54" width="148.362" height="40.855" transform="translate(118.154 180.639)" fill="#6c63ff"/>
    <rect id="Rectangle_55" data-name="Rectangle 55" width="148.362" height="40.855" transform="translate(266.757 180.875)" fill="#6c63ff"/>
    <rect id="Rectangle_56" data-name="Rectangle 56" width="148.362" height="40.855" rx="20.428" transform="translate(118.154 180.639)" fill="#fff" opacity="0.15"/>
    <circle id="Ellipse_36" data-name="Ellipse 36" cx="8.599" cy="8.599" r="8.599" transform="translate(275.237 88.3)" fill="#6c63ff"/>
    <circle id="Ellipse_37" data-name="Ellipse 37" cx="8.599" cy="8.599" r="8.599" transform="translate(275.237 88.3)" opacity="0.3"/>
    <circle id="Ellipse_38" data-name="Ellipse 38" cx="8.599" cy="8.599" r="8.599" transform="translate(141.93 88.3)" fill="#6c63ff"/>
    <circle id="Ellipse_39" data-name="Ellipse 39" cx="8.599" cy="8.599" r="8.599" transform="translate(141.93 88.3)" opacity="0.3"/>
    <ellipse id="Ellipse_40" data-name="Ellipse 40" cx="2.152" cy="3.223" rx="2.152" ry="3.223" transform="translate(144.072 45.057)" fill="#fda57d"/>
    <rect id="Rectangle_57" data-name="Rectangle 57" width="148.362" height="40.855" rx="20.428" transform="translate(266.757 180.875)" fill="#fff" opacity="0.15"/>
    <g id="Groupe_26" data-name="Groupe 26" transform="translate(283.709 67.498)" opacity="0.5">
      <path id="Tracé_77" data-name="Tracé 77" d="M749.8,232.9c-.986-5.423-2-10.906-4.247-15.951A35.032,35.032,0,0,0,734.344,203a3.775,3.775,0,0,0-2.53-.755h0a2.147,2.147,0,0,0-2.072,1.888c-.028.109-.052.212-.071.321a16.568,16.568,0,0,0,.623,8.15,93.009,93.009,0,0,0,4.092,9.845,65.677,65.677,0,0,1,4.969,18.217,25,25,0,0,1,.2,2.539,14.788,14.788,0,0,1-.038,1.524,9.089,9.089,0,0,1-.67,2.893q-.1.227-.212.472a2.806,2.806,0,0,1-.245.434,13.1,13.1,0,0,1-3.511,3.422,16.516,16.516,0,0,1-4.365,2.6h.052a6.3,6.3,0,0,1-2.275.373c-2.421-.076-5-2.025-7.438-1.567h0l-.274.061c-2.492.675-4.4,4.592-4.422,7.079h0v.576a.572.572,0,0,0,.024.2c.024.066.028.25.047.368a1.614,1.614,0,0,0,.047.217c.019.071.043.212.071.316s.042.146.066.217.061.193.094.288.057.142.085.208.075.179.118.264l.1.2c.047.08.09.165.142.245l.123.189.16.227.137.175.184.208.151.16.2.193.165.146.222.179.175.137.241.165.179.123.264.156.184.1.3.146.175.085c.142.066.288.127.434.184l.212.08.34.123.245.076.279.085.274.071.264.066.293.061.255.052.307.052.245.038.316.042.236.028.33.028h2.407l.415-.033h.08a13.615,13.615,0,0,0,3.45-.76,29.553,29.553,0,0,0,9.288-6.338c5.493-5.073,10.685-11.369,11.124-18.835A33.9,33.9,0,0,0,749.8,232.9Z" transform="translate(-716.16 -202.232)" fill="url(#linear-gradient-7)"/>
    </g>
    <rect id="Rectangle_58" data-name="Rectangle 58" width="44.489" height="12.879" transform="translate(249.626 96.37)" opacity="0.1"/>
    <rect id="Rectangle_59" data-name="Rectangle 59" width="44.489" height="11.709" transform="translate(249.626 96.37)" fill="#6c63ff"/>
    <circle id="Ellipse_41" data-name="Ellipse 41" cx="7.022" cy="7.022" r="7.022" transform="translate(268.361 83.888)" fill="#6c63ff"/>
    <path id="Tracé_78" data-name="Tracé 78" d="M670.365,272.232l-.085-.085a1.293,1.293,0,0,0,0-2.062l.076-.094a1.416,1.416,0,0,1,0,2.237Z" transform="translate(-408.224 -170.514)" fill="#4d8af0"/>
    <path id="Tracé_79" data-name="Tracé 79" d="M670.365,272.232l-.085-.085a1.293,1.293,0,0,0,0-2.062l.076-.094a1.416,1.416,0,0,1,0,2.237Z" transform="translate(-408.224 -170.514)" opacity="0.1"/>
    <path id="Tracé_80" data-name="Tracé 80" d="M669.667,272.237a1.416,1.416,0,0,1,0-2.237l.076.094a1.293,1.293,0,0,0,0,2.062Z" transform="translate(-407.611 -170.52)" fill="#4d8af0"/>
    <path id="Tracé_81" data-name="Tracé 81" d="M555.37,210.9h0" transform="translate(-293.271 -111.372)" fill="#4d8af0"/>
    <path id="Tracé_82" data-name="Tracé 82" d="M732.12,289.4a27.161,27.161,0,0,0,8.495-5.8c5.021-4.634,9.76-10.383,10.165-17.211a31.38,31.38,0,0,0-.75-7.433c-.9-4.955-1.822-9.967-3.865-14.573a32.011,32.011,0,0,0-10.241-12.742,3.445,3.445,0,0,0-2.317-.689c-1.416.127-1.775,1.1-1.963,2.029-1.147,5.663,2,11.157,4.3,16.442a60.021,60.021,0,0,1,4.54,16.645c.3,2.435.406,5.069-.878,7.164a12.04,12.04,0,0,1-3.209,3.124c-1.793,1.354-3.775,2.775-6.022,2.709s-4.757-2-7.079-1.373-4.026,4.2-4.04,6.484C719.232,290.377,727.807,291.028,732.12,289.4Z" transform="translate(-434.088 -149.895)" fill="#ffd180"/>
    <g id="Groupe_27" data-name="Groupe 27" transform="translate(285.176 81.04)" opacity="0.1">
      <path id="Tracé_83" data-name="Tracé 83" d="M753.158,273.223a12.04,12.04,0,0,1-3.209,3.124,14.911,14.911,0,0,1-3.993,2.36c2.039-.137,3.865-1.416,5.522-2.685a12.112,12.112,0,0,0,3.209-3.124c1.279-2.091,1.175-4.719.878-7.164a60.013,60.013,0,0,0-4.54-16.645c-2.3-5.29-5.456-10.788-4.3-16.442a2.449,2.449,0,0,1,.944-1.708,3.082,3.082,0,0,0-.524,0c-1.416.127-1.774,1.1-1.963,2.029-1.147,5.663,2,11.157,4.3,16.442a60.012,60.012,0,0,1,4.54,16.645C754.333,268.494,754.442,271.128,753.158,273.223Z" transform="translate(-732.822 -230.926)"/>
      <path id="Tracé_84" data-name="Tracé 84" d="M720.8,336.04c0-2.114,1.505-5.328,3.53-6.291a3.7,3.7,0,0,0-1.024.118c-2.279.618-4.026,4.2-4.04,6.484-.028,5.786,7.424,6.73,11.931,5.517C726.722,342.519,720.775,341.193,720.8,336.04Z" transform="translate(-719.27 -283.11)"/>
    </g>
    <g id="Groupe_28" data-name="Groupe 28" transform="translate(228.134 60.092)" opacity="0.5">
      <path id="Tracé_85" data-name="Tracé 85" d="M624.106,195.908s12.856-2.572,19.283,0c0,0,3.856-9,7.711-9s5.139,14.158,5.139,14.158l5.139,20.567s24.423,43.706,0,66.84-62.98-2.586-62.98-19.3,7.711-51.413,7.711-51.413,7.711-28.278,10.283-30.85S624.106,195.908,624.106,195.908Z" transform="translate(-598.4 -186.539)" fill="url(#linear-gradient-8)"/>
    </g>
    <path id="Tracé_86" data-name="Tracé 86" d="M626.13,200.1s12.355-2.473,18.533,0c0,0,3.7-8.651,7.414-8.651s4.941,13.592,4.941,13.592l4.941,19.769s23.479,42,0,64.254-60.549-2.473-60.549-18.533,7.414-49.426,7.414-49.426,7.414-27.184,9.887-29.656S626.13,200.1,626.13,200.1Z" transform="translate(-371.856 -128.85)" fill="#ffd180"/>
    <g id="Groupe_29" data-name="Groupe 29" transform="translate(230.998 62.241)" opacity="0.1">
      <path id="Tracé_87" data-name="Tracé 87" d="M738.326,285.642a97.739,97.739,0,0,0-8.646-23.092l.779,3.124a97.7,97.7,0,0,1,7.867,19.968Z" transform="translate(-670.589 -228.827)" fill="#fff"/>
      <path id="Tracé_88" data-name="Tracé 88" d="M605.249,267.2c0-16.046,5.979-42.974,5.979-42.974s7.414-27.183,9.887-29.656,7.414,8.651,7.414,8.651,12.355-2.473,18.533,0c0,0,3.709-8.651,7.414-8.651,1.416,0,2.506,2.048,3.271,4.554-.755-3.667-2.039-7.678-4.049-7.678-3.7,0-7.414,8.651-7.414,8.651-6.178-2.473-18.533,0-18.533,0s-4.941-11.119-7.414-8.651-9.887,29.656-9.887,29.656-5.979,26.9-5.979,42.974C604.465,265.534,605.249,267.667,605.249,267.2Z" transform="translate(-604.47 -191.092)" fill="#fff"/>
    </g>
    <circle id="Ellipse_42" data-name="Ellipse 42" cx="2.473" cy="2.473" r="2.473" transform="translate(275.898 90.4)" fill="#58555d"/>
    <circle id="Ellipse_43" data-name="Ellipse 43" cx="2.473" cy="2.473" r="2.473" transform="translate(247.478 90.4)" fill="#58555d"/>
    <ellipse id="Ellipse_44" data-name="Ellipse 44" cx="3.705" cy="2.473" rx="3.705" ry="2.473" transform="translate(261.075 92.873)" fill="#58555d"/>
    <rect id="Rectangle_60" data-name="Rectangle 60" width="11.393" height="1.236" transform="translate(285.651 92.248) rotate(-12.52)" fill="#ffd180"/>
    <rect id="Rectangle_61" data-name="Rectangle 61" width="12.601" height="1.236" transform="translate(285.669 97.187) rotate(-11.27)" fill="#ffd180"/>
    <rect id="Rectangle_62" data-name="Rectangle 62" width="1.236" height="13.309" transform="translate(228.711 87.265) rotate(-68.2)" fill="#ffd180"/>
    <rect id="Rectangle_63" data-name="Rectangle 63" width="1.236" height="16.253" transform="matrix(0.152, -0.988, 0.988, 0.152, 225.158, 93.496)" fill="#ffd180"/>
    <path id="Tracé_89" data-name="Tracé 89" d="M639.225,283.038a56.534,56.534,0,0,1-9.651-.821,53.329,53.329,0,0,1-17.424-6.263l.429-2a58.639,58.639,0,0,0,17.462,6.135c8.9,1.524,24.2,1.067,39.746-7.513l1.038,1.888A68.094,68.094,0,0,1,639.225,283.038Z" transform="translate(-377.527 -171.882)" opacity="0.1"/>
    <path id="Tracé_90" data-name="Tracé 90" d="M668.99,271.61c-15.574,8.58-30.855,9.038-39.746,7.513a58.635,58.635,0,0,1-17.462-6.135l-1.142,1.822a59.592,59.592,0,0,0,18.136,6.423,56.534,56.534,0,0,0,9.656.826,68.352,68.352,0,0,0,31.62-8.556Zm-30.161,10.279a.241.241,0,1,1,.241-.241.241.241,0,0,1-.241.241Z" transform="translate(-376.73 -171.37)" fill="#f55f44"/>
    <path id="Tracé_91" data-name="Tracé 91" d="M665.3,297.8h0a2.388,2.388,0,0,0,2.388,2.388h0a2.388,2.388,0,0,0,2.388-2.388h0a2.388,2.388,0,0,0-2.388-2.388h0A2.388,2.388,0,0,0,665.3,297.8Zm2.388-1.194a.4.4,0,1,1,.4-.4.4.4,0,0,1-.4.4Z" transform="translate(-405.594 -183.938)" opacity="0.1" fill="url(#linear-gradient-9)"/>
    <path id="Tracé_92" data-name="Tracé 92" d="M665.81,298.062h0a2.152,2.152,0,0,0,2.152,2.152h0a2.152,2.152,0,0,0,2.152-2.152h0a2.152,2.152,0,0,0-2.152-2.152h0a2.152,2.152,0,0,0-2.152,2.152Zm2.152-1.076a.359.359,0,1,1,.359-.359A.359.359,0,0,1,667.962,296.986Z" transform="translate(-405.863 -184.202)" fill="#4d8af0"/>
    <path id="Tracé_93" data-name="Tracé 93" d="M669.562,273.13c-32.889,19.349-51.842,1.416-51.842,1.416Z" transform="translate(-380.469 -172.172)" fill="#ffd180"/>
    <path id="Tracé_94" data-name="Tracé 94" d="M595.382,255.219c-2.015-5.715-23.6,10.383-23.6,10.383l-4.988-.3-9.6-8.891,6.7-6.7-56.274-48.255a14.2,14.2,0,0,0-11-3.3l-46.783,5.833c-.2-2.681-1.855-5.866-4.191-9.118-4.8-7.872-14.9-16.758-18.632-19.916L421.3,136.5l4.847-7.273a24.467,24.467,0,0,1-2.643-.887l1.024-1.539-.378-.1.472-.557h-.057l12.072-13.969a5.3,5.3,0,0,0-.4-7.339L409.223,84.3a14.9,14.9,0,0,0,1.152-6.182c.212-4.078-1.614-8.216-7.735-11.279A59.7,59.7,0,0,0,390.8,62.66a38.84,38.84,0,0,0-20.463.3c-.109-.137-.227-.274-.349-.415-8.315-9.5-19.222,4.153-19.647,4.719l-42.625,47.411a8.66,8.66,0,0,0,2.133,11.544l22.563,16.919-.071.146,1.274.944c-.944,1.888-2.261,3.162-3.983,3.355l3.455,1.727a3.973,3.973,0,0,1-1.841.694l15.819,7.91c0,8.221.849,45.858,14.215,64.334a34.164,34.164,0,0,0,4.856,6.277s1.137-.618,3.214-1.619l2.388,4.781A27.957,27.957,0,0,0,400.7,246.862l74.259-10.609-.788,2.36.425-.061-24.069,72.206,3.974,1.326-.076.142.562.241-5.007,9.439-15.758,12.119s46.056,23.026,50.9,19.392-16.99-19.392-16.99-19.392l-1.213-4.847,5.3-11.19,4.441,1.482,35.688-71.375h0l1.213-2.426,24.154,30.2,6.81-6.805.736.746.061-.061,9.439,9.552,6.838,18.665S597.388,260.935,595.382,255.219Zm-187.358-138.8-.472-.547A45.267,45.267,0,0,1,393.9,126.782v-3.969l.269-.236V120.85a26.192,26.192,0,0,0,7.409-26.594L417.26,106.3ZM354.813,71.67l-.378-.378.382.378Zm-12.53,25.239q-.156,1.888-.127,3.8a39.47,39.47,0,0,0,.307,5.536c.807,6.414,3.105,11.657,7.839,14.158,4.125,2.171,6.838,2.053,8.566.571l.189.17a18.6,18.6,0,0,0,1.916,7.211,76.275,76.275,0,0,1-24.923-10.038s.028.321.061.9l-6.484-6.484Z" transform="translate(-216.064 -59.2)" fill="url(#linear-gradient-10)"/>
    <path id="Tracé_95" data-name="Tracé 95" d="M506.315,507.27,495.72,527.285l16.48,7.06,10.595-22.365Z" transform="translate(-261.772 -267.875)" fill="#fda57d"/>
    <path id="Tracé_96" data-name="Tracé 96" d="M610.07,615.945l1.175,4.719s21.19,15.3,16.48,18.835-49.445-18.835-49.445-18.835l15.3-11.775Z" transform="translate(-359.642 -349.475)" fill="#333"/>
    <path id="Tracé_97" data-name="Tracé 97" d="M526.494,515.435,509.82,509.88l-4.96,9.363,16.48,7.065Z" transform="translate(-266.599 -269.253)" opacity="0.1"/>
    <path id="Tracé_98" data-name="Tracé 98" d="M677.69,411.819,693.6,427.931l11.68-13.606-18.16-16.815Z" transform="translate(-357.864 -209.915)" fill="#fda57d"/>
    <path id="Tracé_99" data-name="Tracé 99" d="M688.514,399.17l-9.434,14.314,6.031,6.1,12.237-12.237Z" transform="translate(-358.598 -210.791)" opacity="0.1"/>
    <path id="Tracé_100" data-name="Tracé 100" d="M838.1,480.044l4.847.288s20.954-15.626,22.912-10.076-32.795,41.53-32.795,41.53l-6.64-18.132Z" transform="translate(-490.676 -275.638)" fill="#333"/>
    <path id="Tracé_101" data-name="Tracé 101" d="M491.608,152.279l24.456-28.316a5.144,5.144,0,0,0-.387-7.131L462.461,76.5,456,86.581l41.242,31.747-17.509,19.2Z" transform="translate(-295.07 -68.339)" fill="#fda57d"/>
    <path id="Tracé_102" data-name="Tracé 102" d="M515.926,184.82,507.37,194.2l11.888,14.772,12.27-14.186A35.754,35.754,0,0,1,515.926,184.82Z" transform="translate(-322.197 -125.539)" opacity="0.1"/>
    <path id="Tracé_103" data-name="Tracé 103" d="M346.253,162.722l-27.688-20.765a8.415,8.415,0,0,1-2.072-11.213l41.431-46.1,8.495,8.495-28.661,35.7L354.7,145.779Z" transform="translate(-220.718 -72.638)" fill="#fda57d"/>
    <path id="Tracé_104" data-name="Tracé 104" d="M368.59,214.177l4.531,3.4,8.495-16.942L370.95,190C371.176,193.606,371.813,207.617,368.59,214.177Z" transform="translate(-248.912 -128.274)" opacity="0.1"/>
    <path id="Tracé_105" data-name="Tracé 105" d="M522.248,355.661,496.83,431.912l25.418,8.471L564.6,355.661,530.72,347.19Z" transform="translate(-262.358 -183.342)" fill="#4d8af0"/>
    <path id="Tracé_106" data-name="Tracé 106" d="M546.77,360.651l-1.27,3.813,26.688-3.813,10.425,13.035,6.517-13.035-33.89-8.471Z" transform="translate(-288.059 -185.977)" opacity="0.1"/>
    <path id="Tracé_107" data-name="Tracé 107" d="M405.61,75.981s10.855-14,19.1-4.578S411.759,82,411.759,82Z" transform="translate(-268.461 -63.927)" fill="#fda57d"/>
    <path id="Tracé_108" data-name="Tracé 108" d="M432.32,370.229l8.188,16.381a27.155,27.155,0,0,0,28.132,14.739l99.229-14.158,33.89,42.361,25.414-25.414L572.5,357.275a13.79,13.79,0,0,0-10.685-3.214Z" transform="translate(-282.565 -214.853)" fill="#4d8af0"/>
    <path id="Tracé_109" data-name="Tracé 109" d="M372.579,192.166s2.232,27.514-6.239,28.458l16.942,8.495s-.944,49.888,16.943,67.775c0,0,32.946-17.886,67.775-16.942s-8.495-33.89-8.495-33.89l-5.72-38.567,4.719-7.079a35.4,35.4,0,0,1-16.48-10.595h0c-4.719,5.885-15.508,13.865-24.866,13.865h-4.049c-13.95,0-28.788-2.832-40.544-10.335Z" transform="translate(-247.724 -128.179)" opacity="0.1"/>
    <path id="Tracé_110" data-name="Tracé 110" d="M369.244,187.17s2.251,27.514-6.244,28.453l16.943,8.495s-.944,49.888,16.942,67.775c0,0,32.946-17.886,67.775-16.942s-8.495-33.89-8.495-33.89l-5.72-38.567,4.719-7.079a35.4,35.4,0,0,1-16.48-10.595h0c-4.719,5.885-15.508,13.865-24.866,13.865h-4.049c-13.95,0-28.788-4-40.544-11.515Z" transform="translate(-245.96 -125.539)" fill="#3ad29f"/>
    <path id="Tracé_111" data-name="Tracé 111" d="M423.52,173.36V182.8a18.074,18.074,0,0,0,5.294,12.779L448.938,215.7l6.7-13.4a16.8,16.8,0,0,0,1.774-7.513V173.36Z" transform="translate(-277.918 -119.487)" fill="#fda57d"/>
    <path id="Tracé_112" data-name="Tracé 112" d="M424.07,185.868c0,.349,0,.694.033,1.043a25.409,25.409,0,0,0,33.857-.028V176.41H424.07Z" transform="translate(-278.209 -121.098)" opacity="0.1"/>
    <circle id="Ellipse_45" data-name="Ellipse 45" cx="25.414" cy="25.414" r="25.414" transform="translate(137.13 19.992)" fill="#fda57d"/>
    <path id="Tracé_113" data-name="Tracé 113" d="M405.186,105.922h42.361s16.943-16.942,0-25.414a58,58,0,0,0-11.5-4.059C410.287,69.918,385.789,91.226,389.1,117.6c.783,6.23,3.016,11.326,7.612,13.738C414.6,140.737,405.186,105.922,405.186,105.922Z" transform="translate(-259.584 -67.685)" opacity="0.1"/>
    <path id="Tracé_114" data-name="Tracé 114" d="M405.186,103.432h42.361s16.943-16.942,0-25.414a58,58,0,0,0-11.5-4.059c-25.763-6.532-50.261,14.776-46.948,41.148.783,6.23,3.016,11.326,7.612,13.738C414.6,138.261,405.186,103.432,405.186,103.432Z" transform="translate(-259.584 -66.37)" fill="#333"/>
    <ellipse id="Ellipse_46" data-name="Ellipse 46" cx="2.355" cy="4.12" rx="2.355" ry="4.12" transform="translate(144.474 41.616)" fill="#fda57d"/>
    <path id="Tracé_115" data-name="Tracé 115" d="M283.68,203.975l1.18-3.535,3.53,2.355Z" transform="translate(-149.801 -105.849)" opacity="0.1"/>
    <path id="Tracé_116" data-name="Tracé 116" d="M542.253,304s-12.818,6.135-16.353,12.034" transform="translate(-331.982 -188.474)" opacity="0.1"/>
    <path id="Tracé_117" data-name="Tracé 117" d="M429.4,163.03l-1.175,3.53-2.355-3.53Z" transform="translate(-224.887 -86.094)" opacity="0.1"/>
    <path id="Tracé_118" data-name="Tracé 118" d="M405.186,103.432h42.361s16.943-16.942,0-25.414a58,58,0,0,0-11.5-4.059c-25.763-6.532-50.261,14.776-46.948,41.148.783,6.23,3.016,11.326,7.612,13.738C414.6,138.261,405.186,103.432,405.186,103.432Z" transform="translate(-259.584 -66.37)" fill="#333"/>
    <path id="Tracé_119" data-name="Tracé 119" d="M650.79,338.5s8.594,18.684-2.69,20.293-6.135-15.649-6.135-15.649-1.128-5.121-3.875-5.408" transform="translate(-391.225 -206.291)" opacity="0.1"/>
    <path id="Tracé_120" data-name="Tracé 120" d="M682.2,338.4s-10.217,17.849.878,20.435,7.5-15.041,7.5-15.041,1.576-5,4.342-5.045" transform="translate(-412.251 -206.639)" opacity="0.1"/>
    <path id="Tracé_121" data-name="Tracé 121" d="M648.69,337.379s8.594,18.684-2.69,20.293-6.135-15.649-6.135-15.649-1.128-5.135-3.865-5.423" transform="translate(-390.122 -205.689)" fill="#ffd180"/>
    <path id="Tracé_122" data-name="Tracé 122" d="M683.878,336.73s-10.236,17.853.878,20.421,7.5-15.041,7.5-15.041,1.576-5,4.342-5.045" transform="translate(-413.134 -205.757)" fill="#ffd180"/>
    <rect id="Rectangle_64" data-name="Rectangle 64" width="0.193" height="3.648" transform="translate(252.259 148.099)" fill="#58555d" opacity="0.5"/>
    <rect id="Rectangle_65" data-name="Rectangle 65" width="0.193" height="3.648" transform="translate(255.383 148.099)" fill="#58555d" opacity="0.5"/>
    <rect id="Rectangle_66" data-name="Rectangle 66" width="0.193" height="5.102" transform="translate(253.689 146.938)" fill="#58555d" opacity="0.5"/>
    <rect id="Rectangle_67" data-name="Rectangle 67" width="0.193" height="3.648" transform="translate(272.552 147.32)" fill="#58555d" opacity="0.5"/>
    <rect id="Rectangle_68" data-name="Rectangle 68" width="0.193" height="3.648" transform="translate(275.676 147.32)" fill="#58555d" opacity="0.5"/>
    <rect id="Rectangle_69" data-name="Rectangle 69" width="0.193" height="5.102" transform="translate(273.982 146.155)" fill="#58555d" opacity="0.5"/>
    <g id="Groupe_30" data-name="Groupe 30" transform="translate(230.834 311.827)" opacity="0.5">
      <circle id="Ellipse_47" data-name="Ellipse 47" cx="22.459" cy="22.459" r="22.459" transform="matrix(0.948, -0.318, 0.318, 0.948, 0, 14.283)" fill="url(#linear-gradient-11)"/>
    </g>
    <circle id="Ellipse_48" data-name="Ellipse 48" cx="21.025" cy="21.025" r="21.025" transform="matrix(0.948, -0.318, 0.318, 0.948, 232.651, 327.014)" fill="#f55f44"/>
    <g id="Groupe_31" data-name="Groupe 31" transform="translate(163.721 291.445)" opacity="0.5">
      <path id="Tracé_123" data-name="Tracé 123" d="M501.508,753.742c-3.02,1.015-6.782.293-8.183-2.605-.807-1.675-.613-3.549-.425-5.361.208-1.987.382-3.7-.736-4.809a5.092,5.092,0,0,0-1.992-1.043c-.944-.316-1.963-.58-2.935-.835a29.161,29.161,0,0,1-5.059-1.661c-3.209-1.505-5.262-4.049-5.489-6.805-.194-2.36.944-4.512,2.029-6.574s2.18-4.111,1.661-6.135c-.7-2.732-3.983-4.03-6.871-5.191l-.472-.179c-3.53-1.416-7.315-4.4-6.371-8.235a8.132,8.132,0,0,1,1.992-3.3,10.035,10.035,0,0,0,1.416-2.025c1.274-2.685-.472-5.791-1.251-7a31.363,31.363,0,0,0-2.029-2.676,25.871,25.871,0,0,1-2.893-4.1l-.132-.245c-1.916-3.624-1.954-3.775-1.793-7.726v-.472l1.671.066v.472c-.142,3.582-.142,3.582,1.6,6.876l.132.245a24.245,24.245,0,0,0,2.714,3.827c.722.892,1.468,1.817,2.124,2.8,2.025,3.063,2.52,6.211,1.364,8.641a11.42,11.42,0,0,1-1.661,2.36,7.051,7.051,0,0,0-1.652,2.652c-.736,2.978,3.025,5.347,5.366,6.281l.448.179c3.1,1.227,6.961,2.756,7.877,6.31.68,2.638-.58,5.017-1.8,7.32-1.024,1.935-2,3.776-1.841,5.663.208,2.534,2.478,4.464,4.531,5.432a27.487,27.487,0,0,0,4.771,1.557c1,.26,2.034.533,3.044.868a6.541,6.541,0,0,1,2.643,1.444c1.685,1.671,1.449,3.96,1.222,6.173-.17,1.652-.335,3.214.269,4.46,1.09,2.256,4.469,2.586,6.819,1.477a18.509,18.509,0,0,0,5.045-4.078c.519-.529,1.057-1.071,1.6-1.59,2.992-2.832,6.017-4.068,8.754-3.591a12.351,12.351,0,0,1,2.525.816,12.464,12.464,0,0,0,1.949.67,6.008,6.008,0,0,0,6.867-4.4c.061-.278.1-.571.151-.878a5.313,5.313,0,0,1,1.095-2.959,5.513,5.513,0,0,1,2.907-1.383l9.108-2.1.378,1.628-9.108,2.1a3.943,3.943,0,0,0-2.044.878,4,4,0,0,0-.675,2.081c-.047.321-.1.656-.17.986a7.678,7.678,0,0,1-8.863,5.663,13.909,13.909,0,0,1-2.213-.755,10.938,10.938,0,0,0-2.185-.717c-2.775-.472-5.507,1.449-7.315,3.157-.524.5-1.052,1.034-1.562,1.548a20.045,20.045,0,0,1-5.522,4.417,7.848,7.848,0,0,1-.831.378Z" transform="translate(-461.914 -676.76)" fill="url(#linear-gradient-12)"/>
    </g>
    <path id="Tracé_124" data-name="Tracé 124" d="M501.988,751.982c-3.02,1.015-6.782.293-8.183-2.605-.807-1.675-.613-3.549-.425-5.361.208-1.987.382-3.7-.736-4.809a5.092,5.092,0,0,0-1.992-1.043c-.944-.316-1.963-.581-2.935-.835a29.171,29.171,0,0,1-5.059-1.661c-3.209-1.505-5.262-4.049-5.489-6.805-.194-2.36.944-4.512,2.029-6.574s2.18-4.111,1.661-6.135c-.7-2.732-3.983-4.03-6.871-5.191l-.472-.179c-3.53-1.416-7.315-4.4-6.371-8.235a8.132,8.132,0,0,1,1.992-3.3,10.036,10.036,0,0,0,1.416-2.025c1.274-2.685-.472-5.791-1.251-7a31.372,31.372,0,0,0-2.029-2.676,25.873,25.873,0,0,1-2.893-4.1l-.132-.245c-1.916-3.624-1.954-3.775-1.793-7.726V675l1.671.066v.472c-.142,3.582-.142,3.582,1.6,6.876l.132.245a24.24,24.24,0,0,0,2.714,3.827c.722.892,1.468,1.817,2.124,2.8,2.025,3.063,2.52,6.211,1.364,8.641a11.42,11.42,0,0,1-1.661,2.36,7.051,7.051,0,0,0-1.652,2.652c-.736,2.978,3.025,5.347,5.366,6.281l.448.179c3.1,1.227,6.961,2.756,7.877,6.31.68,2.638-.58,5.017-1.8,7.32-1.024,1.935-2,3.775-1.841,5.663.208,2.534,2.478,4.464,4.531,5.432a27.487,27.487,0,0,0,4.771,1.557c1,.26,2.034.533,3.044.868A6.54,6.54,0,0,1,493.781,738c1.685,1.671,1.449,3.959,1.222,6.173-.17,1.652-.335,3.214.269,4.46,1.09,2.256,4.469,2.586,6.819,1.477a18.509,18.509,0,0,0,5.045-4.078c.519-.529,1.057-1.071,1.6-1.59,2.992-2.832,6.017-4.068,8.754-3.591a12.352,12.352,0,0,1,2.525.816,12.478,12.478,0,0,0,1.949.67,6.008,6.008,0,0,0,6.867-4.4c.061-.278.1-.571.151-.878a5.313,5.313,0,0,1,1.095-2.959,5.513,5.513,0,0,1,2.907-1.383l9.108-2.1.378,1.628-9.108,2.1a3.942,3.942,0,0,0-2.043.878,4,4,0,0,0-.675,2.081c-.047.321-.1.656-.17.986a7.678,7.678,0,0,1-8.863,5.663,13.9,13.9,0,0,1-2.213-.755,10.926,10.926,0,0,0-2.185-.717c-2.775-.472-5.508,1.449-7.315,3.157-.524.5-1.052,1.034-1.562,1.548a20.044,20.044,0,0,1-5.522,4.417A7.845,7.845,0,0,1,501.988,751.982Z" transform="translate(-298.447 -384.386)" fill="#f55f44"/>
    <path id="Tracé_125" data-name="Tracé 125" d="M661.78,748.407s11.633-1.76,17.329,14.474" transform="translate(-403.735 -423.12)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_126" data-name="Tracé 126" d="M631.808,774.512s-8.636-12.223,6.753-25.7" transform="translate(-386.632 -423.362)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_127" data-name="Tracé 127" d="M639.993,780.2s-4.167-6.414.2-12.162" transform="translate(-391.283 -433.517)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_128" data-name="Tracé 128" d="M657.81,762.88s5.517,2.18,6.291,12" transform="translate(-401.639 -430.792)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_129" data-name="Tracé 129" d="M671.53,738.52s8.618,1.647,14.63,13.5" transform="translate(-408.884 -417.928)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_130" data-name="Tracé 130" d="M648,744.386s4.073-2.879,7.853-1.373" transform="translate(-396.458 -420.071)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_131" data-name="Tracé 131" d="M654.52,796.692s5.446,3.464,19.482-6.532" transform="translate(-399.901 -445.198)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_132" data-name="Tracé 132" d="M652.47,818.6s3.407,3.393,10.5.51" transform="translate(-398.819 -460.216)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_133" data-name="Tracé 133" d="M627.543,754.77A18.406,18.406,0,0,0,625,769.735" transform="translate(-383.996 -426.509)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_134" data-name="Tracé 134" d="M640.73,801.17a4.7,4.7,0,0,0,3.105,4.752" transform="translate(-392.61 -451.012)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_135" data-name="Tracé 135" d="M696.565,793.38s-.217,6.135-3.615,6.5" transform="translate(-420.195 -446.898)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_136" data-name="Tracé 136" d="M661.1,808.276a13.6,13.6,0,0,0,11.326-3.776" transform="translate(-403.376 -452.77)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_137" data-name="Tracé 137" d="M672.22,766.06a6.629,6.629,0,0,1,2.657,5.663" transform="translate(-409.248 -432.471)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_138" data-name="Tracé 138" d="M648.2,774.59s-.821,4.309,1.3,6.871" transform="translate(-396.484 -436.976)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
    <path id="Tracé_139" data-name="Tracé 139" d="M653.66,772.82s3.03,3.775,2.2,6.569" transform="translate(-399.447 -436.041)" fill="none" stroke="#000" stroke-miterlimit="10" stroke-width="1" opacity="0.2"/>
  </g>
</SVG>

);

const SVG = styled.svg`
    width: 30rem;
    @media (max-width: 600px){
        width: 20rem;
    }
    @media (max-width: 450px){
        width: 15rem;
    }
    @media (max-width: 330px){
        width: 10rem;
    }
`;