import styled from "styled-components";

export const MockupLike = () => (
    <SVG xmlns="http://www.w3.org/2000/svg" width="341.997" height="254.332" viewBox="0 0 341.997 254.332">
    <defs>
        <linearGradient id="linear-gradient" x1="0.5" y1="1" x2="0.5" gradientUnits="objectBoundingBox">
        <stop offset="0.21" stop-color="#fff" stop-opacity="0"/>
        <stop offset="1" stop-color="#fff" stop-opacity="0.2"/>
        </linearGradient>
    </defs>
    <g id="Слой_2" data-name="Слой 2" transform="translate(-0.003 0)">
        <g id="Слой_1" data-name="Слой 1" transform="translate(0.003 0)">
        <g id="Mobile" transform="translate(0 48.791)">
            <path id="Tracé_38" data-name="Tracé 38" d="M90.145,280.683,4.878,231.435c-7.223-4.166-6.32-11.45,2.052-16.265L212.875,96.263c8.345-4.788,20.958-5.342,28.181-1.17l85.267,49.248c7.223,4.172,6.313,11.457-2.052,16.272L118.333,279.506C109.981,284.328,97.368,284.848,90.145,280.683Z" transform="translate(-0.003 -77.953)" fill="#d6d8e5" opacity="0.4"/>
            <path id="Tracé_39" data-name="Tracé 39" d="M105.936,271.2,20.669,221.956c-7.223-4.172-6.313-11.457,2.052-16.272l205.938-118.9C237,82,249.617,81.449,256.84,85.615l85.267,49.248c7.223,4.166,6.32,11.45-2.052,16.265L134.117,270.034C125.772,274.85,113.159,275.376,105.936,271.2Z" transform="translate(-4.994 -74.959)" fill="#b1b4c4"/>
            <path id="Tracé_40" data-name="Tracé 40" d="M15.79,272.162V264.31L25,267.785Z" transform="translate(-4.992 -132.313)" fill="#b1b4c4"/>
            <path id="Tracé_41" data-name="Tracé 41" d="M496.616,165.341V157.79l-7.326,4.72Z" transform="translate(-154.619 -98.652)" fill="#b1b4c4"/>
            <path id="Tracé_42" data-name="Tracé 42" d="M105.936,261.493,20.669,212.245c-7.223-4.166-6.313-11.45,2.052-16.265L228.659,77.073c8.345-4.788,20.958-5.342,28.181-1.17l85.267,49.248c7.223,4.172,6.32,11.457-2.052,16.272l-205.938,118.9C125.772,265.138,113.159,265.658,105.936,261.493Z" transform="translate(-4.994 -71.889)" fill="#616e84"/>
            <ellipse id="Ellipse_16" data-name="Ellipse 16" cx="0.917" cy="1.58" rx="0.917" ry="1.58" transform="translate(23.593 148.176) rotate(-30)" fill="#757b89"/>
            <ellipse id="Ellipse_17" data-name="Ellipse 17" cx="0.917" cy="1.58" rx="0.917" ry="1.58" transform="translate(27.695 150.547) rotate(-30)" fill="#757b89"/>
            <ellipse id="Ellipse_18" data-name="Ellipse 18" cx="0.917" cy="1.58" rx="0.917" ry="1.58" transform="translate(31.806 152.917) rotate(-30)" fill="#757b89"/>
            <ellipse id="Ellipse_19" data-name="Ellipse 19" cx="0.917" cy="1.58" rx="0.917" ry="1.58" transform="translate(35.908 155.288) rotate(-30)" fill="#757b89"/>
            <ellipse id="Ellipse_20" data-name="Ellipse 20" cx="0.92" cy="1.585" rx="0.92" ry="1.585" transform="translate(71.434 176.522) rotate(-29.887)" fill="#757b89"/>
            <ellipse id="Ellipse_21" data-name="Ellipse 21" cx="0.917" cy="1.58" rx="0.917" ry="1.58" transform="translate(75.251 178.004) rotate(-30)" fill="#757b89"/>
            <ellipse id="Ellipse_22" data-name="Ellipse 22" cx="0.917" cy="1.58" rx="0.917" ry="1.58" transform="translate(79.355 180.374) rotate(-30)" fill="#757b89"/>
            <ellipse id="Ellipse_23" data-name="Ellipse 23" cx="0.917" cy="1.58" rx="0.917" ry="1.58" transform="translate(83.457 182.746) rotate(-30)" fill="#757b89"/>
            <path id="Tracé_43" data-name="Tracé 43" d="M83.015,317.165l-11.272-6.5a3.092,3.092,0,0,1-1.293-2.469h0c0-.958.575-1.368,1.293-.978l11.272,6.5a3.1,3.1,0,0,1,1.293,2.476h0C84.308,317.144,83.733,317.582,83.015,317.165Z" transform="translate(-22.265 -145.824)" fill="#757b89"/>
            <path id="Tracé_44" data-name="Tracé 44" d="M456.87,194.6l-10.486,6.053c-.684.383-1.2,0-1.2-.91h0a2.873,2.873,0,0,1,1.2-2.291L456.87,191.4c.684-.383,1.2,0,1.2.91h0A2.866,2.866,0,0,1,456.87,194.6Z" transform="translate(-140.68 -109.227)" fill="#757b89"/>
            <path id="Tracé_45" data-name="Tracé 45" d="M433.39,208.153,422.9,214.207c-.684.383-1.2,0-1.2-.91h0a2.887,2.887,0,0,1,1.2-2.3l10.486-6.067c.684-.383,1.2,0,1.2.91h0A2.873,2.873,0,0,1,433.39,208.153Z" transform="translate(-133.26 -113.503)" fill="#757b89"/>
            <path id="Tracé_46" data-name="Tracé 46" d="M105.936,259.724,20.669,210.476c-7.223-4.172-6.313-11.457,2.052-16.272L228.659,75.3c8.345-4.788,20.958-5.335,28.181-1.17l85.267,49.248c7.223,4.166,6.32,11.45-2.052,16.265L134.117,258.554C125.772,263.37,113.159,263.9,105.936,259.724Z" transform="translate(-4.994 -71.331)" fill="#20232d"/>
            <path id="Tracé_47" data-name="Tracé 47" d="M339.26,127.72,305.97,108.5l-.082.048a15.736,15.736,0,0,1-14.241,0c-3.933-2.271-3.933-5.958,0-8.208l.082-.041-33.29-19.22c-5.055-2.921-13.256-2.921-18.311,0l-200.61,115.8c-5.055,2.914-5.055,7.647,0,10.568l80.814,46.662c5.062,2.921,13.256,2.921,18.311,0L339.26,138.288C344.315,135.367,344.315,130.634,339.26,127.72Z" transform="translate(-11.292 -73.719)" fill="#fff"/>
            <path id="Tracé_48" data-name="Tracé 48" d="M339.261,138.277,138.651,254.1c-4.569,2.64-11.717,2.886-16.778.752a12.639,12.639,0,0,1-1.525-.752L39.526,207.436a8.537,8.537,0,0,1-2.839-2.462c-1.908-2.736-.964-5.917,2.839-8.105L240.129,81.04c5.055-2.914,13.249-2.914,18.311,0l33.29,19.227-.082.048c-3.933,2.271-3.933,5.944,0,8.208a15.736,15.736,0,0,0,14.241,0l.075-.041,33.3,19.22C344.316,130.63,344.316,135.357,339.261,138.277Z" transform="translate(-11.293 -73.709)" opacity="0.5" fill="url(#linear-gradient)"/>
            <ellipse id="Ellipse_24" data-name="Ellipse 24" cx="3.824" cy="2.209" rx="3.824" ry="2.209" transform="translate(281.463 29.767)" fill="#2b303f"/>
            <path id="Tracé_49" data-name="Tracé 49" d="M415.212,118.27a.684.684,0,0,1,0-1.313,2.538,2.538,0,0,1,2.264,0,.684.684,0,0,1,0,1.313A2.538,2.538,0,0,1,415.212,118.27Z" transform="translate(-131.055 -85.665)" fill="#fff" opacity="0.1"/>
        </g>
        <path id="Tracé_50" data-name="Tracé 50" d="M321.175,175.038l-71.348-41.2c-4.145-2.394-3.625-6.573,1.163-9.337l48-27.7c4.788-2.736,12.038-3.071,16.183-.684l71.368,41.2c4.145,2.394,3.625,6.573-1.163,9.343l-48,27.709C332.564,177.131,325.32,177.432,321.175,175.038Z" transform="translate(-78.064 -29.866)" fill="#e9eaf2"/>
        <path id="Tracé_51" data-name="Tracé 51" d="M330.2,140.021,304.509,144l4.125-8.885-40.274,6.231,11.259,6.5,18.222,10.52,18.81,10.862Z" transform="translate(-84.805 -42.695)" fill="#dadce5"/>
        <ellipse id="Ellipse_25" data-name="Ellipse 25" cx="12.743" cy="7.36" rx="12.743" ry="7.36" transform="translate(265.663 102.689)" fill="#dadce5"/>
        <path id="Tracé_52" data-name="Tracé 52" d="M214.675,236.519l-71.348-41.19c-4.145-2.394-3.625-6.573,1.163-9.343l47.989-27.709c4.788-2.736,12.038-3.064,16.183-.684l71.348,41.19c4.145,2.4,3.625,6.58-1.163,9.343l-48,27.709C226.064,238.619,218.827,238.913,214.675,236.519Z" transform="translate(-44.41 -49.295)" fill="#e9eaf2"/>
        <path id="Tracé_53" data-name="Tracé 53" d="M173.328,269.63l-48,27.7a15.163,15.163,0,0,1-3.016,1.327,12.64,12.64,0,0,1-1.525-.752L39.969,251.245a8.537,8.537,0,0,1-2.839-2.462,11.21,11.21,0,0,1,1.84-1.306l48-27.709c4.788-2.736,12.038-3.064,16.183-.684l71.368,41.2C178.629,262.681,178.116,266.86,173.328,269.63Z" transform="translate(-11.735 -68.726)" fill="#e9eaf2"/>
        <path id="Tracé_54" data-name="Tracé 54" d="M117.2,262.991l-25.691,3.974,4.125-8.885L55.36,264.311l11.265,6.5,18.215,10.52,18.81,10.855Z" transform="translate(-17.496 -81.553)" fill="#dadce5"/>
        <ellipse id="Ellipse_26" data-name="Ellipse 26" cx="12.743" cy="7.36" rx="12.743" ry="7.36" transform="translate(119.971 186.807)" fill="#dadce5"/>
        <path id="Tracé_55" data-name="Tracé 55" d="M436.463,140.32l-1.443-.834,2.415-1.4,1.443.834Z" transform="translate(-137.469 -43.636)" fill="#e9eaf2"/>
        <path id="Tracé_56" data-name="Tracé 56" d="M439.29,141.694l-1.45-.834,3.379-1.949,1.45.834Z" transform="translate(-138.361 -43.896)" fill="#e9eaf2"/>
        <path id="Tracé_57" data-name="Tracé 57" d="M442.11,142.935l-1.45-.834,4.829-2.791,1.45.834Z" transform="translate(-139.252 -44.022)" fill="#e9eaf2"/>
        <path id="Tracé_58" data-name="Tracé 58" d="M444.933,144.05l-1.443-.834,6.758-3.906,1.45.834Z" transform="translate(-140.146 -44.022)" fill="#e9eaf2"/>
        <path id="Tracé_59" data-name="Tracé 59" d="M453.74,149.736l-2.25-1.3,4.5-2.606,2.257,1.3Z" transform="translate(-142.674 -46.082)" fill="#e9eaf2"/>
        <path id="Tracé_60" data-name="Tracé 60" d="M458.13,152.269l-2.25-1.3,4.508-2.6,2.25,1.3Z" transform="translate(-144.061 -46.885)" fill="#e9eaf2"/>
        <path id="Tracé_61" data-name="Tracé 61" d="M462.52,154.806l-2.25-1.3,4.508-2.606,2.25,1.306Z" transform="translate(-145.449 -47.684)" fill="#e9eaf2"/>
        <path id="Tracé_62" data-name="Tracé 62" d="M265.768,41.765,195.193,1.019c-1.915-1.1-3.653-1.279-4.98-.684h0a3.584,3.584,0,0,0-.527.294l-7.367,4.1,5.363,7.524V65.513a16.544,16.544,0,0,0,7.524,13l27.647,15.958,3.365,8.68L222.69,118.5l7.8-4.337,7.627-10.882,23.94,13.83.841,7.175,7.729-4.309c1.607-.684,2.633-2.428,2.633-5.068V54.774A16.542,16.542,0,0,0,265.768,41.765Z" transform="translate(-57.616 0)" fill="#edeef7"/>
        <path id="Tracé_63" data-name="Tracé 63" d="M256.829,48.1,186.254,7.356c-4.145-2.394-7.524-.451-7.524,4.337V71.885a16.544,16.544,0,0,0,7.524,13L213.9,100.838l7.64,19.7,7.64-10.876,27.647,15.965c4.152,2.394,7.524.451,7.524-4.337V61.112A16.607,16.607,0,0,0,256.829,48.1Z" transform="translate(-56.481 -2)" fill="#f8f9ff"/>
        <path id="Tracé_64" data-name="Tracé 64" d="M249.061,85.4c-.451-5.978-3.96-12.155-8.345-14.692-2.921-1.683-5.6-1.416-7.107.629a17.519,17.519,0,0,0-6.936-8.735c-4.384-2.531-7.893-.4-8.345,5.055a12.79,12.79,0,0,0,.267,3.9,31.546,31.546,0,0,0,4.282,10.691L233.616,99.7l10.944-4.945A7.989,7.989,0,0,0,248.828,89,10.794,10.794,0,0,0,249.061,85.4Z" transform="translate(-68.98 -19.447)" fill="#ff5757"/>
        <ellipse id="Ellipse_27" data-name="Ellipse 27" cx="21.067" cy="12.161" rx="21.067" ry="12.161" transform="translate(145.71 132.703)" opacity="0.05"/>
        </g>
    </g>
    </SVG>
);

const SVG = styled.svg`
    width: 80%;
    @media (max-width: 600px){
        width: 70vw;
    }
    @media (max-width: 450px){
        width: 60vw;
    }
    @media (max-width: 330px){
        width: 50vw;
    }
`;